#include <iostream>

using namespace std;

int main()
{
    cout<<"\"Зерна огненного цвета\"\n"; cout<<"\"Брошу на ладонь,\"\n"; cout<<"\"Чтоб предстал он в бездне света\"\n"; cout<<"\"Красный как огонь.\"\n";
    cout<<"\"Советским вельможей,\"\n"; cout<<"\"При полном Синоде...\"\n"; cout<<"\"— Здорово, Сережа!\"\n"; cout<<"\"— Здорово, Володя!\"\n";
    cout<<"\"Умаялся? — Малость.\"\n"; cout<<"\"— По общим? — По личным.\"\n"; cout<<"\"— Стрелялось? — Привычно.\"\n"; cout<<"\"— Горелось? — Отлично.\"\n";
    cout<<"\"— Так стало быть пожил?\"\n"; cout<<"\"— Пасс в нектором роде.\"\n"; cout<<"\"...Негоже, Сережа!\"\n"; cout<<"\"...Негоже, Володя!\"\n"; 
    cout<<"\"А помнишь, как матом\"\n"; cout<<"\"Во весь свой эстрадный\"\n"; cout<<"\"Басище — меня-то\"\n"; cout<<"\"Обкладывал? — Ладно\"\n"; 
    cout<<"\"Уж... — Вот те и шлюпка\"\n"; cout<<"\"Любовная лодка!\"\n"; cout<<"\"Ужель из-за юбки?\"\n"; cout<<"\"— Хужѐй из-за водки.\"\n"; 
    cout<<"\"Опухшая рожа.\"\n"; cout<<"\"С тех пор и на взводе?\"\n"; cout<<"\"Негоже, Сережа.\"\n"; cout<<"\"— Негоже, Володя.\"\n"; 
    cout<<"\"А впрочем — не бритва —\"\n"; cout<<"\"Сработано чисто.\"\n"; cout<<"\"Так стало быть бита\"\n"; cout<<"\"Картишка? — Сочится.\"\n"; 
    cout<<"\"— Приложь подорожник.\"\n"; cout<<"\"— Хорош и коллодий.\"\n"; cout<<"\"Приложим, Сережа?\"\n"; cout<<"\"— Приложим, Володя.\"\n"; 
    cout<<"\"А что на Рассее —\"\n"; cout<<"\"На матушке? — То есть\"\n"; cout<<"\"Где? — В Эсэсэсере\"\n"; cout<<"\"Что нового? — Строят.\"\n"; 
    cout<<"\"Родители — ро̀дят,\"\n"; cout<<"\"Вредители — точут,\"\n"; cout<<"\"Издатели — водят,\"\n"; cout<<"\"Писатели — строчут.\"\n"; 
    cout<<"\"Мост новый заложен,\"\n"; cout<<"\"Да смыт половодьем.\"\n"; cout<<"\"Всё то же, Сережа!\"\n"; cout<<"\"— Всё то же, Володя.\"\n"; 
    cout<<"\"А певчая стая?\"\n"; cout<<"\"— Народ, знаешь, тертый!\"\n"; cout<<"\"Нам лавры сплетая,\"\n"; cout<<"\"У нас как у мертвых\"\n"; 
    cout<<"\"Прут. Старую Росту\"\n"; cout<<"\"Да завтрашним лаком.\"\n"; cout<<"\"Да не обойдешься\"\n"; cout<<"\"С одним Пастернаком.\"\n"; 
    cout<<"\"Хошь, руку приложим\"\n"; cout<<"\"На ихнем безводье?\"\n"; cout<<"\"Приложим, Сережа?\"\n"; cout<<"\"— Приложим, Володя!\"\n"; 
    cout<<"\"Еще тебе кланяется...\"\n"; cout<<"\"— А что добрый\"\n"; cout<<"\"Наш Льсан Алексаныч?\"\n"; cout<<"\"— Вон — ангелом! — Федор\"\n"; 
    cout<<"\"Кузьмич? — На канале:\"\n"; cout<<"\"По красные щеки\"\n"; cout<<"\"Пошел, — Гумилев Николай?\"\n"; cout<<"\"— На Востоке.\"\n"; 
    cout<<"\"(В кровавой рогоже,\"\n"; cout<<"\"На полной подводе...)\"\n"; cout<<"\"— Всё то же, Сережа.\"\n"; cout<<"\"— Всё то же, Володя.\"\n"; 
    cout<<"\"А коли всё то же,\"\n"; cout<<"\"Володя, мил-друг мой —\"\n"; cout<<"\"Вновь руки наложим,\"\n"; cout<<"\"Володя, хоть рук и —\"\n"; 
    cout<<"\"Нет.\"\n"; cout<<"\"— Хоть и нету,\"\n"; cout<<"\"Сережа, мил-брат мой,\"\n"; cout<<"\"Под царство и это\"\n"; 
    cout<<"\"Подложим гранату!\"\n"; cout<<"\"И на раствороженном\"\n"; cout<<"\"Нами Восходе —\"\n"; cout<<"\"Заложим, Сережа!\"\n"; cout<<"\"— Заложим, Володя!\"\n";
    return 0;
}